# Install with: brew bundle
# Brewfile - Homebrew dependencies for dotfiles

# Taps
# tap "homebrew/bundle"
tap "siderolabs/tap"

# Core tools
brew "git"
brew "stow"
brew "neovim"

# Shells
brew "zsh"
brew "fish"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Shell enhancements
brew "btop"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "yq"
brew "jq"
brew "tmux"
brew "lazyssh"
brew "gotop"

# Claude Code
brew "ccusage"

# Development tools
brew "node"
brew "python@3"
brew "rustup"
brew "lazygit"
brew "opentofu"
brew "gh"
brew "htop"
brew "ncdu"
brew "k9s"
brew "helm"
brew "cloudflared"
brew "siderolabs/tap/talosctl"

# Neovim dependencies
brew "tree-sitter"
brew "luarocks"

# Optional: Terminal emulators (uncomment if desired)
cask "iterm2"
# cask "alacritty"
# cask "kitty"
cask "rectangle"
cask "tailscale"

# Optional: Fonts (uncomment if desired)
tap "homebrew/cask-fonts"
# cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

