# Brewfile - Homebrew dependencies for dotfiles
# Install with: brew bundle

# Taps
tap "homebrew/bundle"

# Core tools
brew "git"
brew "stow"
brew "neovim"

# Shell enhancements
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "yq"
brew "jq"
brew "tmux"
brew "lazyssh"
brew "gotop"
brew "fish"

# Development tools
brew "node"
brew "python@3"
brew "rustup"
brew "lazygit"
brew "htop"
brew "ncdu"
brew "k9s"

# Neovim dependencies
brew "tree-sitter"
brew "luarocks"

# Optional: Terminal emulators (uncomment if desired)
cask "iterm2"
# cask "alacritty"
# cask "kitty"
cask "rectangle"

# Optional: Fonts (uncomment if desired)
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

